app/controllers/api/feeds_controller.rb

  def update
    feed = Feed.find(params[:id])
    if feed.update(feed_params)
---
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "8"]]
UPDATE "feeds" SET "title" = $1, "updated_at" = $2 WHERE "feeds"."id" = 8  [["title", "WIRED!!"], ["updated_at", Fri, 21 Nov 2014 01:41:39 UTC +00:00]]